[
    {
        "MovieName": "Aladdin (2019)",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/pp_aladdin2019_herobanner_19736_df5ad245.jpeg?region=0,0,2048,878",
        "Duration": "2h 8min",
        "Date": "May 23, 2019",
        "Gender": "Adventure, Family, Fantasy",
        "Description": "From Disney comes a thrilling and vibrant live-action adaptation of the animated classic Aladdin, featuring Will Smith as the larger-than-life Genie, with the charming street rat Aladdin and the courageous, self-determined Princess Jasmine!",
        "Director": "Guy Ritchie",
        "Writer": "John August, Guy Ritchie",
        "Producer": "Dan Lin, Jonathan Eirich",
        "Cast": "Will Smith, Mena Massoud, Naomi Scott, Marwan Kenzari, Navid Negahban",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_9e35a739.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Ant-Man and the Wasp",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_923f0583.jpeg?region=0,0,2048,878",
        "Duration": "1h 58min",
        "Date": "July 5, 2018",
        "Gender": "Action-Adventure, Comedy, Science Fiction",
        "Description": "As he struggles to balance his home life and Super Hero duties, Scott Lang finds he must suit up as Ant-Man again, joining the Wasp on an urgent mission to uncover secrets from the past.",
        "Director": "Peyton Reed",
        "Writer": "Chris McKenna, Erik Sommers, Paul Rudd, Andrew Barrer, Gabriel Ferrari",
        "Producer": "Kevin Feige",
        "Cast": "Paul Rudd, Evangeline Lilly, Michael Peña, Walton Goggins, Hannah John-Kamen, David Dastmalchian, Tip \"T.I.\" Harris, Judy Greer, Bobby Cannavale, Randall Park, Abby Ryder Fortson",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_ae30e307.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Avengers: Endgame",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/h_avengersendgame_19751_b8067b68.jpeg?region=0,0,2048,878",
        "Duration": "3h 1min",
        "Date": "June 6, 2019",
        "Gender": "Action, Adventure, Science Fiction",
        "Description": "The fourth installment in the Avengers saga is the culmination of 22 interconnected films and the climax of an epic journey. Earth’s heroes will finally understand how fragile our reality is—and the sacrifices that must be made to uphold it—in a story of friendship, teamwork and setting aside differences to overcome an impossible obstacle.",
        "Director": "Anthony Russo, Joe Russo",
        "Writer": "Christopher Markus, Stephen McFeely",
        "Producer": "Kevin Feige",
        "Cast": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Benedict Cumberbatch, Chadwick Boseman, Brie Larson, Tom Holland, Karen Gillan, Zoë Saldana, Evangeline Lilly, Tessa Thompson, Rene Russo, Elizabeth Olsen, Anthony Mackie, Sebastian Stan",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_avengersendgame_19751_e14a0104.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Avengers: Infinity War",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/pp_avengersinfinitywar_herobanner_19871_bd17a892.jpeg?region=0,0,2048,878",
        "Duration": "2h 29min",
        "Date": "April 26, 2018",
        "Gender": "Action-Adventure, Fantasy, Science Fiction",
        "Description": "With the powerful Thanos on the verge of raining destruction upon the universe, the Avengers and their Super Hero allies risk everything in the ultimate showdown of all time.",
        "Director": "Anthony Russo, Joe Russo",
        "Writer": "Christopher Markus, Stephen McFeely",
        "Producer": "Kevin Feige",
        "Cast": "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Don Cheadle, Benedict Cumberbatch, Tom Holland, Chadwick Boseman, Zoë Saldana",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_avengersinfinitywar_19871_cb171514.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Black Panther",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/h_blackpanther_19754_2f6270c7.jpeg?region=0,0,2048,878",
        "Duration": "2h 14min",
        "Date": "February 15, 2018",
        "Gender": "Action-Adventure, Science Fiction",
        "Description": "When young King T’Challa is drawn into conflict with an old foe that puts his homeland Wakanda and the entire world at risk, he must release Black Panther’s full power to save them.",
        "Director": "Ryan Coogler",
        "Writer": "Ryan Coogler, Joe Robert Cole",
        "Producer": "Kevin Feige",
        "Cast": "Chadwick Boseman, Michael B. Jordan, Lupita Nyong'o, Danai Gurira, Martin Freeman, Daniel Kaluuya, Letitia Wright, Winston Duke, Sterling K. Brown, Florence Kasumba",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_blackpanther_19754_4ac13f07.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Black Widow",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_41f18950.jpeg?region=0,0,2048,878",
        "Duration": "2h 13min",
        "Date": "July 8, 2021",
        "Gender": "Action, Adventure, Science Fiction",
        "Description": "In Marvel Studios’ action-packed spy thriller “Black Widow,” Natasha Romanoff aka Black Widow confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
        "Director": "Cate Shortland",
        "Writer": "Eric Pearson",
        "Producer": "Kevin Feige",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_b97b56f3.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Captain Marvel",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/h_captainmarvel_19755_aacee62b.jpeg?region=0,0,2048,878",
        "Duration": "2h 4min",
        "Date": "March 7, 2019",
        "Gender": "Action-Adventure, Science Fiction",
        "Description": "Marvel Studios’ Captain Marvel takes you on a spectacular adventure from the 1990s, tracing the path of Carol Danvers (Brie Larson) as she becomes one of the universe’s most powerful heroes. When a galactic war reaches Earth, she meets young agent Nick Fury (Samuel L. Jackson) at the center of a maelstrom, leading to her ultimate destiny as an Avenger!",
        "Director": "Anna Boden, Ryan Fleck",
        "Writer": "Anna Boden, Ryan Fleck, Geneva Robertson-Dworet",
        "Producer": "Kevin Feige",
        "Cast": "Brie Larson, Samuel L. Jackson, Ben Mendelsohn, Djimon Hounsou, Lee Pace, Lashana Lynch, Gemma Chan, Rune Temte, Algenis Perez Soto, Mckenna Grace",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_captainmarvel_19755_3a1675ee.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Christopher Robin",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_cd4fa1f1.jpeg?region=0,0,2048,878",
        "Duration": "1h 44min",
        "Date": "August 16, 2018",
        "Gender": "Drama, Family, Fantasy",
        "Description": "With the Hundred Acre Wood deserted and an empty hunny jar, Winnie the Pooh goes through a magical door seeking Christopher Robin, only to find him all grown up and in London. Joined by old friends and new family, they embark on a remarkable adventure and learn that “sometimes doing nothing leads to the very best something.”",
        "Director": "Marc Forster",
        "Writer": "Alex Ross Perry, Tom McCarthy, Allison Schroeder",
        "Producer": "Brigham Taylor, Kristin Burr",
        "Cast": "Ewan McGregor, Hayley Atwell, Bronte Carmichael, Mark Gatiss, Oliver Ford Davies, Ronke Adekoluejo, Adrian Scarborough",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_2a028710.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Coco",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_6da7b6e8.jpeg?region=0,0,2048,878",
        "Duration": "1h 46min",
        "Date": "November 23, 2017",
        "Gender": "Animation, Family, Fantasy, Musical",
        "Description": "In Disney•Pixar’s extraordinary adventure, a boy who dreams of becoming a great musician embarks on a journey to uncover the mysteries behind his ancestor’s stories and traditions.",
        "Director": "Lee Unkrich",
        "Writer": "Adrian Molina, Matthew Aldrich",
        "Producer": "Darla K. Anderson",
        "Cast": "Anthony Gonzalez, Gael García Bernal, Benjamin Bratt, Alanna Ubach, Renée Victor, Jaime Camil, Alfonso Arau, Herbert Siguenza, Herbert Siguenza, Gabriel Iglesias",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_coco_19736_fd5fa537.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Cruella",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/pp_cruella_herobanner_20915_65ae3631.jpeg?region=0,0,2048,878",
        "Date": "Comedy, Crime",
        "Description": "Emma Stone (LA LA LAND) stars in Disney’s CRUELLA, an all-new live-action feature film about the rebellious early days of one of cinema’s most notorious – and notoriously fashionable – villains, the legendary Cruella de Vil. Set during the 1970s punk rock revolution in London, the story follows a clever and creative young grifter named Estella, who is determined to become a successful designer. After Estella befriends a pair of young thieves who appreciate her appetite for mischief, the three build a life for themselves on the London streets. Before long, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a devastatingly chic and terrifyingly haute fashion legend, played by Emma Thompson (HOWARDS END, SENSE AND SENSIBILITY). But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent “Cruella.” CRUELLA is directed by Craig Gillespie (I, TONYA) from a screenplay by Dana Fox and Tony McNamara, story by Aline Brosh McKenna and Kelly Marcel & Steve Zissis. It was produced by Andrew Gunn (FREAKY FRIDAY), Marc Platt (MARY POPPINS RETURNS) and Kristin Burr (CHRISTOPHER ROBIN), with Emma Stone, Michelle Wright, Jared LeBoff and Glenn Close serving as executive producers. Spectacular costume designer Jenny Beavan (MAD MAX: FURY ROAD, A ROOM WITH A VIEW) creates the dazzling and imaginative costumes, which take on a life of their own. WARNING: Some flashing lights scenes in this film may affect photosensitive viewers.",
        "Director": "Craig Gillespie",
        "Writer": "Dana Fox, Tony McNamara",
        "Producer": "Andrew Gunn, Marc Platt, Kristin Burr",
        "Cast": "Emma Stone, Emma Thompson, Joel Fry, Paul Walter Hauser, Emily Beecham, Kirby Howell-Baptiste, Mark Strong, Tipper Seifert Cleveland, Kayvan Novak, John McCrea, Jamie Demetriou, Niamh Lynch, Andrew Leung, Ed Birch, Dylan Lowe, Paul Bazely, Abraham Popoola, Leo Bill, Ninette Finch, Sarah Crowden",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_7ff71125.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Doctor Strange in the Multiverse of Madness",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_dd168f3c.jpeg?region=0,0,2048,878",
        "Description": "There are so many amazing movies to look forward to, and among those is the latest movie Doctor Strange in the Multiverse of Madness from Marvel.",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_659514fa.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Dumbo (2019)",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/h_dumbo_19753_5e07dac2.jpeg?region=0,0,2048,878",
        "Duration": "1h 52min",
        "Date": "March 28, 2019",
        "Gender": "Adventure, Family, Fantasy",
        "Description": "From Disney and director Tim Burton, the grand live-action adventure Dumbo expands on the beloved classic where differences are celebrated, family is cherished and dreams take flight. A struggling circus makes an incredible comeback with a baby elephant that can fly, but when they attract a new investor they soon discover his new plans conceal dark secrets.",
        "Director": "Tim Burton",
        "Writer": "Ehren Kruger",
        "Producer": "Justin Springer, Ehren Kruger, Katterli Frauenfelder, Derek Frey",
        "Cast": "Colin Farrell, Michael Keaton, Danny DeVito, Eva Green, Alan Arkin, Nico Parker, Finley Hobbins, Roshan Seth, Lars Eidinger, DeObia Oparei",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_dumbo_19753_7f6610fc.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Encanto",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_f03f65b0.jpeg?region=0,0,2048,878",
        "Description": "Walt Disney Animation Studios’ “Encanto” tells the tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family with a unique gift from super strength to the power to heal—every child except one, Mirabel (voice of Stephanie Beatriz). But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family’s last hope. Releasing on Nov. 24, 2021, the film features all-new songs by Emmy®, GRAMMY® and Tony Award® winner Lin-Manuel Miranda (“Hamilton,” “Moana”) and is directed by Byron Howard (“Zootopia,” “Tangled”) and Jared Bush (co-director “Zootopia”), co-directed by Charise Castro Smith (writer “The Death of Eva Sofia Valdez”), and produced by Clark Spencer and Yvett Merino; Bush and Castro Smith are screenwriters on the film.",
        "Director": "Jared Bush, Byron Howard",
        "Writer": "Charise Castro Smith, Jared Bush",
        "Producer": "Yvett Merino, Clark Spencer",
        "Cast": "Stephanie Beatriz, María Cecilia Botero, John Leguizamo, Mauro Castillo, Jessica Darrow, Angie Cepeda, Carolina Gaitán, Diane Guerrero, Wilmer Valderrama, Rhenzy Feliz, Ravi Cabot-Conyers, Adassa Candiani",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_adf151ff.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Eternals",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_f9b0fb6d.jpeg?region=0,0,2048,878",
        "Date": "Action, Adventure, Science Fiction",
        "Description": "Marvel Studios’ “Eternals” welcomes an exciting new team of Super Heroes to the Marvel Cinematic Universe. The epic story, spanning thousands of years, features a group of immortal heroes forced out of the shadows to reunite against mankind’s oldest enemy, The Deviants. The outstanding ensemble cast includes Richard Madden as the all-powerful Ikaris, Gemma Chan as humankind-loving Sersi, Kumail Nanjiani as cosmic-powered Kingo, Lauren Ridloff as the super-fast Makkari, Brian Tyree Henry as the intelligent inventor Phastos, Salma Hayek as the wise and spiritual leader Ajak, Lia McHugh as the eternally young, old-soul Sprite, Don Lee as the powerful Gilgamesh, Barry Keoghan as aloof loner Druig, and Angelina Jolie as the fierce warrior Thena. Kit Harington plays Dane Whitman. Directed by Chloé Zhao.",
        "Director": "Chloé Zhao",
        "Writer": "Gemma Chan, Richard Madden, Kumail Nanjiani, Lia McHugh, Brian Tyree Henry, Lauren Ridloff, Barry Keoghan, Don Lee, Kit Harington, Salma Hayek, Angelina Jolie",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_517212da.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Frozen 2",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_108a0407.jpeg?region=0,0,2048,878",
        "Duration": "1h 44min",
        "Date": "November 21, 2019",
        "Gender": "Action-Adventure, Animation, Family, Fantasy, Musical",
        "Description": "Why was Elsa born with magical powers? What truths about the past await Elsa as she ventures into the unknown to the enchanted forests and dark seas beyond Arendelle? The answers are calling her but also threatening her kingdom. Together with Anna, Kristoff, Olaf and Sven, she'll face a dangerous but remarkable journey. In Frozen, Elsa feared her powers were too much for the world. In Frozen 2, she must hope they are enough.",
        "Director": "Chris Buck, Jennifer Lee",
        "Writer": "Jennifer Lee",
        "Producer": "Peter Del Vecho",
        "Cast": "Kristen Bell, Idina Menzel, Josh Gad, Jonathan Groff, Sterling K. Brown, Evan Rachel Wood, Alfred Molina, Martha Plimpton, Jason Ritter, Rachel Matthews, Jeremy Sisto, Ciaran Hinds, Alan Tudyk, Hadley Gannaway, Mattea Conforti, AURORA, Alan Tudyk, Santino Fontana, Libby Stubenrauch, Eva Bella",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_bf2c13ad.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Incredibles 2",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_b0a8d5c1.jpeg?region=0,0,2048,878",
        "Duration": "1h 58min",
        "Date": "June 14, 2018",
        "Gender": "Action-Adventure, Animation, Family, Science Fiction",
        "Description": "Helen is called on to help bring Supers back, and Bob must juggle the daily heroics of home life. But when a new villain arises with a sinister plot, the Parrs meet the challenge together!",
        "Director": "Brad Bird",
        "Writer": "Brad Bird",
        "Producer": "John Walker, Nicole Paradis Grindle",
        "Cast": "Craig T. Nelson, Holly Hunter, Sarah Vowell, Huckleberry Milner, Catherine Keener, Eli Fucile, Bob Odenkirk, Samuel L. Jackson, Michael Bird, Sophia Bush",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_theincredibles2_meen_002144c9.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Jungle Cruise",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_f900fddb.jpeg?region=0,0,2048,878",
        "Duration": "2h 7min",
        "Date": "Action, Adventure, Comedy",
        "Description": "Seeking an ancient tree with healing abilities, Dr. Lily Houghton and wisecracking skipper Frank Wolff team up for the adventure-of-a lifetime on Disney’s Jungle Cruise, a rollicking ride down the Amazon. Amidst danger and supernatural forces lurking in the jungle, secrets of the lost tree unfold as their fate—and mankind’s—hangs in the balance.",
        "Director": "Jaume Collet-Serra",
        "Writer": "Michael Green, Glenn Ficarra, John Requa",
        "Producer": "John Davis, John Fox, Beau Flynn, Dwayne Johnson, Hiram Garcia",
        "Cast": "Dwayne Johnson, Emily Blunt, Edgar Ramirez, Jack Whitehall, Jesse Plemons, Paul Giamatti, Veronica Falcón, Dani Rovira, Quim Gutierrez, Dan Dargan Carter, Andy Nyman, Raphael Alejandro, Simone Lockhart, Pedro Lopez, Sulem Calderon, Sebastian Blunt, Mark Ashworth, Allan Poppleton, Caroline Paige, James Quattrochi",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_04c33520.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Lightyear",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_dcced439.jpeg?region=0,0,2048,878",
        "Description": "Disney and Pixar’s “Lightyear,” an original feature film. The sci-fi action-adventure presents the definitive origin story of Buzz Lightyear—the hero who inspired the toy—introducing the legendary Space Ranger who would win generations of fans. Chris Evans lends his voice to Buzz. “The phrase ‘a dream come true’ gets thrown around a lot, but I’ve never meant it more in my life,” says Evans. “Anyone who knows me knows that my love for animated films runs deep. I can’t believe that I get to be a part of the Pixar family and work with these truly brilliant artists who tell stories unlike anyone else. Watching them work is nothing short of magic. I pinch myself every day.” Annie Award-winning director and veteran Pixar animator Angus MacLane, who co-directed 2016’s “Finding Dory,” helms “Lightyear.” Galyn Susman (“Toy Story That Time Forgot” short) produces.",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_d993a639.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Luca",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_f3cb90ed.jpeg?region=0,0,2048,878",
        "Duration": "2h 0min",
        "Date": "June 17, 2021",
        "Gender": "Action, Adventure, Animation, Comedy",
        "Description": "Set in a seaside town on the Italian Riviera, Disney and Pixar’s “Luca” is a coming-of-age story about a young boy experiencing an unforgettable summer. Luca shares these adventures with his friend, Alberto, but all the fun is threatened by a deeply-held secret: they are sea monsters from another world below the water’s surface. “Luca” is directed by Enrico Casarosa and produced by Andrea Warren.",
        "Director": "Enrico Casarosa",
        "Writer": "Andrea Warren",
        "Producer": "Jacob Tremblay, Jack Dylan Grazer, Emma Berman, Maya Rudolph, Marco Barricelli, Jim Gaffigan",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_2ff75a5c.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Maleficent: Mistress of Evil",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/pp_maleficentmistressofevil_herobanner_19736_16f82449.jpeg?region=0,0,2048,878",
        "Duration": "1h 59min",
        "Date": "October 17, 2019",
        "Gender": "Action-Adventure, Family, Fantasy",
        "Description": "Visit the official website for Disney's Maleficent: Mistress of Evil, starring Angelina Jolie and Elle Fanning. Now available on Digital Download.",
        "Director": "Joachim Rønning",
        "Writer": "Linda Woolverton, Noah Harpster, Micah Fitzerman-Blue",
        "Producer": "Joe Roth, Angelina Jolie, Duncan Henderson",
        "Cast": "Angelina Jolie, Elle Fanning, Chiwetel Ejiofor, Sam Riley, Harris Dickinson, Harris Dickinson, Ed Skrein, Imelda Staunton, Juno Temple, Lesley Manville",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_maleficentmistressofevil_19736_42ce0589.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Mary Poppins Returns",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/h_marypoppinsreturns_19755_5cdee810.jpeg?region=0,0,2048,878",
        "Duration": "2h 10min",
        "Date": "December 27, 2018",
        "Gender": "Family, Fantasy, Musical",
        "Description": "The magic returns in Disney’s reimagined classic as Mary Poppins (Emily Blunt) helps the Banks family remember the joy of what it’s like to be a child. Together with her friend Jack the lamplighter (Lin-Manuel Miranda), fun is brought back to the streets of London in celebration that everything is possible…even the impossible!",
        "Director": "Rob Marshall",
        "Writer": "David Magee",
        "Producer": "John DeLuca, Rob Marshall, Marc Platt",
        "Cast": "Emily Blunt, Lin-Manuel Miranda, Ben Whishaw, Emily Mortimer, Julie Walters, Pixie Davies, Nathanael Saleh, Joel Dawson, Colin Firth, Meryl Streep",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_2a67e7d8.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Mulan",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_5f862b88.jpeg?region=0,0,2048,878",
        "Duration": "1h 55min",
        "Date": "September 4, 2020",
        "Gender": "Action, Adventure, Drama",
        "Description": "Acclaimed filmmaker Niki Caro brings the epic tale of China’s legendary warrior to life in Disney’s MULAN, in which a fearless young woman risks everything out of love for her family and her country to become one of the greatest warriors China has ever known. When the Emperor of China issues a decree that one man per family must serve in the Imperial Army to defend the country from Northern invaders, Hua Mulan, the eldest daughter of an honored warrior, steps in to take the place of her ailing father. Masquerading as a man, Hua Jun, she is tested every step of the way and must harness her inner-strength and embrace her true potential. It is an epic journey that will transform her into an honored warrior and earn her the respect of a grateful nation…and a proud father.",
        "Director": "Niki Caro",
        "Writer": "Rick Jaffa, Amanda Silver, Lauren Hynek, Elizabeth Martin",
        "Producer": "Chris Bender, Jake Weiner, Jason T. Reed",
        "Cast": "Yifei Liu, Donnie Yen, Gong Li, Jet Li, Jason Scott Lee, Yoson An, Tzi Ma, Rosalind Chao, Cheng Pei Pei, Xana Tang, Ron Yuan, Jun Yu, Chen Tang, Doua Moua, Jimmy Wong, Nelson Lee, Hoon Lee, Crystal Rao, Elena Askin, Vincent Feng",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_b541ad5b.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Onward",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_50210716.jpeg?region=0,0,2048,878",
        "Duration": "1h 42min",
        "Date": "March 5, 2020",
        "Gender": "Adventure, Animation, Comedy, Kids & Family",
        "Description": "In Disney and Pixar’s ONWARD, two teenage elf brothers Ian and Barley Lightfoot (voices of Tom Holland and Chris Pratt) get an unexpected opportunity to spend one more day with their late dad and embark on an extraordinary quest aboard Barley’s epic van Guinevere. Like any good quest, their journey is filled with magic spells, cryptic maps, impossible obstacles, and unimaginable discoveries. But when the boys’ fearless mom Laurel (voice of Julia Louis-Dreyfus) realizes that her sons are missing, she teams up with a part-lion, part-bat, part-scorpion, former warrior – aka The Manticore (voice of Octavia Spencer) – and heads off to find them. Perilous curses aside, this one magical day could mean more than any of them ever dreamed.",
        "Director": "Dan Scanlon",
        "Writer": "Dan Scanlon, Jason Headley, Keith Bunin",
        "Producer": "Kori Rae",
        "Cast": "Tom Holland, Chris Pratt, Julia Louis-Dreyfus, Octavia Spencer, Mel Rodriguez, Kyle Bornheimer, Lena Waithe, Ali Wong, Grey Griffin, Tracey Ullman, Wilmer Valderrama, George Psarras, John Ratzenberger",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_2ea507d5.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Ralph Breaks the Internet",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_cf322731.jpeg?region=0,0,2048,878",
        "Duration": "1h 52min",
        "Date": "November 22, 2018",
        "Gender": "Action-Adventure, Animation, Comedy, Family",
        "Description": "In Disney’s Ralph Breaks the Internet Ralph and Vanellope risk it all by traveling to the world wide web—which may or may not survive Ralph’s wrecking.",
        "Director": "Rich Moore, Phil Johnston",
        "Writer": "Phil Johnston, Pamela Ribon",
        "Producer": "Clark Spencer",
        "Cast": "John C. Reilly, Sarah Silverman, Gal Gadot, Jane Lynch, Jack McBrayer, Alan Tudyk, Alfred Molina, Ed O'Neill, Taraji P. Henson, Sean Giambrone",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_94f89ec1.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Raya And The Last Dragon",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_3fa9fe38.jpeg?region=0,0,2048,878",
        "Date": "Action-Adventure, Animation, Family, Fantasy",
        "Description": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when sinister monsters known as the Druun threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, those same monsters have returned and it’s up to a lone warrior, Raya, to track down the last dragon in order to finally stop the Druun for good. However, along her journey, she’ll learn that it’ll take more than dragon magic to save the world—it’s going to take trust as well. From directors Don Hall and Carlos López Estrada, co-directors Paul Briggs and John Ripa, producers Osnat Shurer and Peter Del Vecho, and featuring the voices of Kelly Marie Tran as Raya and Awkwafina as Sisu.",
        "Director": "Don Hall, Carlos López Estrada",
        "Writer": "Qui Nguyen, Adele Lim",
        "Producer": "Osnat Shurer, Peter Del Vecho",
        "Cast": "Kelly Marie Tran, Awkwafina, Izaac Wang, Gemma Chan, Daniel Dae Kim, Benedict Wong, Jona Xiao, Sandra Oh, Thalia Tran, Lucille Soong, Alan Tudyk, Gordon Ip, Dichen Lachman, Patti Harrison, Jon \"Dumbfoundead\" Park, Sung Kang, Sierra Katow, Ross Butler, François Chau, Paul Yen",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_792f778b.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Ron’s Gone Wrong",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_0a7dc971.jpeg?region=0,0,2048,878",
        "Date": "Animation, Comedy",
        "Description": "20th Century Studios and Locksmith Animation’s RON’S GONE WRONG is the story of Barney, a socially awkward middle-schooler, and Ron, his new walking, talking, digitally connected device, which is supposed to be his “best friend out of the box.” Ron’s hilarious malfunctions — set against the backdrop of the social media age — launch Barney and Ron into an action-packed journey in which boy and robot come to terms with the wonderful messiness of true friendship. RON’S GONE WRONG features the voices of Zach Galifianakis (BOB’S BURGERS, A WRINKLE IN TIME), Jack Dylan Grazer (LUCA, SHAZAM!), Ed Helms (THE OFFICE), Justice Smith (JURASSIC WORLD: FALLEN KINGDOM), Rob Delaney (DEADPOOL 2), Olivia Colman (THE CROWN), Kylie Cantrall (GABBY DURAN & THE UNSITTABLES), Ricardo Hurtado (THE GOLDBERGS), Marcus Scribner (BLACK-ISH) and Thomas Barbusca (CHAD).",
        "Director": "Sarah Smith, Jean-Philippe Vine",
        "Writer": "Peter Baynham, Sarah Smith",
        "Producer": "Julie Lockhart, Lara Breay",
        "Cast": "Zach Galifianakis, Jack Dylan Grazer, Ed Helms, Justice Smith, Rob Delaney, Kylie Cantrall, Ricardo Hurtado, Olivia Colman",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_3bcade0d.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Shang-Chi and the Legend of the Ten Rings",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_0e382f24.jpeg?region=0,0,2048,878",
        "Date": "Action, Adventure, Fantasy",
        "Description": "Marvel Studios’ SHANG-CHI AND THE LEGEND OF THE TEN RINGS stars Simu Liu as Shang-Chi, who must face the past he thought he left behind and confront his father, leader of the dangerous Ten Rings organization. The film also stars Awkwafina as Shang-Chi’s friend Katy, Meng’er Zhang, Fala Chen, and Florian Munteanu, with Michelle Yeoh as Ying Nan and Tony Leung as Xu Wenwu. SHANG-CHI AND THE LEGEND OF THE TEN RINGS is directed by Destin Daniel Cretton and produced by Kevin Feige and Jonathan Schwartz, with Louis D’Esposito, Victoria Alonso and Charles Newirth serving as executive producers. Screenplay by Dave Callaham & Destin Daniel Cretton & Andrew Lanham. Screen Story by Dave Callaham & Destin Daniel Cretton.",
        "Director": "Destin Daniel Cretton",
        "Writer": "Dave Callaham, Destin Daniel Cretton, Andrew Lanham",
        "Producer": "Kevin Feige, Jonathan Schwartz",
        "Cast": "Simu Liu, Awkwafina, Meng'er Zhang, Fala Chen, Florian Munteanu, Ronny Chieng, Michelle Yeoh, Tony Leung",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_a537b05d.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Solo: A Star Wars Story",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_8bd49560.jpeg?region=0,0,2048,878",
        "Duration": "2h 15min",
        "Date": "May 24, 2018",
        "Gender": "Action-Adventure, Crime, Science Fiction",
        "Description": "Through a series of daring escapades, Han Solo befriends his mighty future copilot Chewbacca in an epic adventure directed by Ron Howard and written by Jonathan & Lawrence Kasdan.",
        "Director": "Ron Howard",
        "Writer": "Jonathan Kasdan, Lawrence Kasdan",
        "Producer": "Kathleen Kennedy, Allison Shearmur, Simon Emanuel",
        "Cast": "Alden Ehrenreich, Woody Harrelson, Emilia Clarke, Donald Glover, Thandie Newton, Phoebe Waller-Bridge, Joonas Suotamo, Paul Bettany, Jon Favreau, Erin Kellyman",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_517b1d6c.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Soul",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_6351615d.jpeg?region=0,0,2048,878",
        "Duration": "1h 40min",
        "Date": "December 25, 2020",
        "Gender": "Animation, Comedy, Family, Fantasy, Musical",
        "Description": "What is it that makes you...YOU? This November, Pixar Animation Studios’ all-new feature film “Soul” introduces Joe Gardner (voice of Jamie Foxx) – a middle-school band teacher who gets the chance of a lifetime to play at the best jazz club in town. But one small misstep takes him from the streets of New York City to The Great Before – a fantastical place where new souls get their personalities, quirks and interests before they go to Earth. Determined to return to his life, Joe teams up with a precocious soul, 22 (voice of Tina Fey), who has never understood the appeal of the human experience. As Joe desperately tries to show 22 what’s great about living, he may just discover the answers to some of life’s most important questions.",
        "Director": "Pete Docter",
        "Writer": "Pete Docter, Mike Jones, Kemp Powers",
        "Producer": "Dana Murray",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_26efb119.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Star Wars: The Last Jedi",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_82a338d3.jpeg?region=0,0,2048,878",
        "Duration": "2h 32min",
        "Date": "December 14, 2017",
        "Gender": "Action-Adventure, Science Fiction",
        "Description": "The Star Wars saga continues in The Last Jedi as the heroes and galactic legends go on an epic adventure unlocking mysteries of the Force and shocking revelations of the past.",
        "Director": "Rian Johnson",
        "Writer": "Rian Johnson",
        "Producer": "Kathleen Kennedy, Ram Bergman",
        "Cast": "Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Andy Serkis, Lupita Nyong'o, Domhnall Gleeson, Anthony Daniels",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_fb8bbf87.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Star Wars: The Rise of Skywalker (Episode IX)",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_4f4977c7.jpeg?region=0,0,2048,878",
        "Duration": "2h 22min",
        "Date": "December 19, 2019",
        "Gender": "Action, Adventure, Science Fiction",
        "Description": "Lucasfilm and director J.J. Abrams join forces once more to take viewers on an epic journey to a galaxy far, far away with STAR WARS: THE RISE OF SKYWALKER. Experience the riveting conclusion of the landmark Skywalker saga, in which new legends will be born—and the final battle for freedom is yet to come.",
        "Director": "J.J. Abrams",
        "Writer": "Derek Connolly, Colin Trevorrow, Chris Terrio, J.J. Abrams",
        "Producer": "Kathleen Kennedy, J.J. Abrams, Michelle Rejwan",
        "Cast": "Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, Ian McDiarmid, Billy Dee Williams, Greg Grunberg, Shirley Henderson, Billie Lourd, Dominic Monaghan",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_a89e70e8.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "The Lion King",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_1302afc6.jpeg?region=0,0,2048,878",
        "Duration": "1h 58min",
        "Date": "July 18, 2019",
        "Gender": "Action-Adventure, Drama, Family, Musical",
        "Description": "Disney’s The Lion King, directed by Jon Favreau, journeys to the African savanna, where a future king is born. Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub’s arrival. Scar, Mufasa’s brother—and former heir to the throne—has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba’s exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his. The all-star cast includes Donald Glover as Simba, Beyoncé Knowles-Carter as Nala, James Earl Jones as Mufasa, Chiwetel Ejiofor as Scar, Seth Rogen as Pumbaa and Billy Eichner as Timon. Disney’s The Lion King utilizes pioneering filmmaking techniques to bring treasured characters to life in a whole new way.",
        "Director": "Jon Favreau",
        "Writer": "Jeff Nathanson",
        "Producer": "Jon Favreau, Jeffrey Silver, Karen Gilchrist",
        "Cast": "Donald Glover, Seth Rogen, Chiwetel Ejiofor, Alfre Woodard, Billy Eichner, John Kani, John Oliver, Florence Kasumba, Eric André, Keegan-Michael Key, JD McCrary, Shahadi Wright Joseph, Beyoncé Knowles-Carter, James Earl Jones, Penny Johnson Jerald, Amy Sedaris, Chance Bennett, Josh McCrary, Phil LaMarr, J. Lee",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_809c2428.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "The Nutcracker and the Four Realms",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/pp_thenutcrackerandthefourrealms_herobanner_19871_1f645add.jpeg?region=0,0,2048,878",
        "Duration": "1h 39min",
        "Date": "November 1, 2018",
        "Gender": "Adventure, Family, Fantasy",
        "Description": "In Disney’s reimagining of The Nutcracker, a mysterious gift from her mother launches Clara on a journey to four secret realms—where she discovers her greatest strength could change the world.",
        "Director": "Lasse Hallström, Joe Johnston",
        "Writer": "Ashleigh Powell",
        "Producer": "Mark Gordon, Larry Franco",
        "Cast": "Keira Knightley, Mackenzie Foy, Eugenio Derbez, Jayden Fowora-Knight, Matthew Macfadyen, Richard E. Grant, Sergei Polunin, Misty Copeland, Helen Mirren, Morgan Freeman",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/p_thenutcrackerandthefourrealms_19871_32e84c89.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Toy Story 4",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_b1768b78.jpeg?region=0,0,2048,878",
        "Duration": "1h 40min",
        "Date": "June 20, 2019",
        "Gender": "Adventure, Animation, Comedy, Kids & Family",
        "Description": "Pixar Animation Studios proudly presents the adventure of a lifetime! When Woody, Buzz and the gang join Bonnie on a road trip with her new craft-project-turned-toy, Forky, the innocent little spork’s hilarious antics launch Woody on a wild quest filled with unexpected new characters—and one long-lost friend! Toy Story 4 is a soaring masterpiece stuffed with spectacular animation, humor and heart.",
        "Director": "Josh Cooley",
        "Writer": "Andrew Stanton, Stephany Folsom",
        "Producer": "Mark Nielsen, Jonas Rivera",
        "Cast": "Tom Hanks, Tim Allen, Annie Potts, Tony Hale, Keegan-Michael Key, Madeleine McGraw, Christina Hendricks, Jordan Peele, Keanu Reeves, Ally Maki, Jay Hernandez, Lori Alan, Joan Cusack, Bonnie Hunt, Kristen Schaal, Emily Davis, Wallace Shawn, John Ratzenberger, Blake Clark, June Squibb",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_ffefe4c8.jpeg?region=0%2C0%2C540%2C810"
    },
    {
        "MovieName": "Turning Red",
        "CoverImg": "https://lumiere-a.akamaihd.net/v1/images/image_f1714af7.jpeg?region=0,0,2048,878",
        "Date": "Animation",
        "Description": "Young actress Rosalie Chiang lends her voice to Mei Lee, a 13-year-old who suddenly “poofs” into a giant red panda when she gets too excited (which is practically ALWAYS). Sandra Oh voices Mei Lee’s protective, if not slightly overbearing mother, Ming, who is never far from her daughter—an unfortunate reality for the teenager. Directed by Shi and produced by Lindsey Collins.",
        "CardImg": "https://lumiere-a.akamaihd.net/v1/images/image_73ed95dd.jpeg?region=0%2C0%2C540%2C810"
    }
]